; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v7 - type_2 ?v8 - type_3)
 	      (pred_2 ?v6 - object ?v8 - type_3)
	      (pred_1 ?v7 - type_2 ?v1 - type_1)
	      (pred_3 ?v7 - type_2 ?v6 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v7 - type_2 ?v5 ?v2 - type_3)
       :precondition (and  (pred_4 ?v7 ?v5))
       :effect (and  (pred_4 ?v7 ?v2)
		     (not (pred_4 ?v7 ?v5))))

   (:action op_1
       :parameters (?v7 - type_2 ?v4 - object ?v3 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v3) (pred_4 ?v7 ?v3) (pred_1 ?v7 ?v1))
       :effect (and (pred_3 ?v7 ?v4 ?v1)
		    (not (pred_2 ?v4 ?v3)) 
		    (not (pred_1 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_2 ?v4 - object ?v3 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v7 ?v4 ?v1) (pred_4 ?v7 ?v3))
       :effect (and (pred_2 ?v4 ?v3)
		    (pred_1 ?v7 ?v1)
		    (not (pred_3 ?v7 ?v4 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_13 - type_2
obj_03 obj_07 obj_06 obj_12 - type_1
obj_02 obj_04 obj_09 obj_10 - type_3
obj_11 obj_14 obj_08 obj_05 - object)
(:init
(pred_4 obj_01 obj_02)
(pred_1 obj_01 obj_03)
(pred_1 obj_01 obj_07)
(pred_4 obj_13 obj_04)
(pred_1 obj_13 obj_06)
(pred_1 obj_13 obj_12)
(pred_2 obj_11 obj_04)
(pred_2 obj_14 obj_09)
(pred_2 obj_08 obj_09)
(pred_2 obj_05 obj_10)
)
(:goal
(and
(pred_2 obj_11 obj_02)
(pred_2 obj_14 obj_04)
(pred_2 obj_08 obj_10)
(pred_2 obj_05 obj_10)
)
)

(:constraints
  (always (not (pred_4 obj_01 obj_09)))
)
)

; plan
1. (op_1 obj_13 obj_11 obj_04 obj_12)
   deleted: (pred_2 obj_11 obj_04) (pred_1 obj_13 obj_12)
   added: (pred_3 obj_13 obj_11 obj_12)
   goals met: 1 of 4
2. (op_2 obj_01 obj_02 obj_10)
   deleted: (pred_4 obj_01 obj_02)
   added: (pred_4 obj_01 obj_10)
   goals met: 1 of 4
3. (op_2 obj_13 obj_04 obj_02)
   deleted: (pred_4 obj_13 obj_04)
   added: (pred_4 obj_13 obj_02)
   goals met: 1 of 4
4. (op_2 obj_01 obj_10 obj_04)
   deleted: (pred_4 obj_01 obj_10)
   added: (pred_4 obj_01 obj_04)
   goals met: 1 of 4
5. (op_3 obj_13 obj_11 obj_02 obj_12)
   deleted: (pred_3 obj_13 obj_11 obj_12)
   added: (pred_2 obj_11 obj_02) (pred_1 obj_13 obj_12)
   goals met: 2 of 4
6. (op_2 obj_01 obj_04 obj_10)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_10)
   goals met: 2 of 4
7. (op_2 obj_13 obj_02 obj_09)
   deleted: (pred_4 obj_13 obj_02)
   added: (pred_4 obj_13 obj_09)
   goals met: 2 of 4
8. (op_1 obj_13 obj_08 obj_09 obj_12)
   deleted: (pred_2 obj_08 obj_09) (pred_1 obj_13 obj_12)
   added: (pred_3 obj_13 obj_08 obj_12)
   goals met: 2 of 4
9. (op_1 obj_13 obj_14 obj_09 obj_06)
   deleted: (pred_2 obj_14 obj_09) (pred_1 obj_13 obj_06)
   added: (pred_3 obj_13 obj_14 obj_06)
   goals met: 2 of 4
10. (op_2 obj_13 obj_09 obj_10)
   deleted: (pred_4 obj_13 obj_09)
   added: (pred_4 obj_13 obj_10)
   goals met: 2 of 4
11. (op_3 obj_13 obj_08 obj_10 obj_12)
   deleted: (pred_3 obj_13 obj_08 obj_12)
   added: (pred_2 obj_08 obj_10) (pred_1 obj_13 obj_12)
   goals met: 3 of 4
12. (op_2 obj_13 obj_10 obj_04)
   deleted: (pred_4 obj_13 obj_10)
   added: (pred_4 obj_13 obj_04)
   goals met: 3 of 4
13. (op_3 obj_13 obj_14 obj_04 obj_06)
   deleted: (pred_3 obj_13 obj_14 obj_06)
   added: (pred_2 obj_14 obj_04) (pred_1 obj_13 obj_06)
   goals met: 4 of 4
